Revit 2024 API
BuiltInFailures.ElectricalFailures.ObjsDemolished Property
 Cannot assign [Element] to circuit. Objects that are demolished cannot be added to a circuit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ObjsDemolished { get; }
Visual Basic
Public Shared ReadOnly Property ObjsDemolished As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ObjsDemolished {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ElectricalFailures Class
Autodesk.Revit.DB Namespace